Uhome-systems/Uhome/Software/nRF5_SDK_for_Zigbee_v4.2.0/examples/zigbee/experimental/SmartValve/zigbee_helpers_TWV.c
        case ZB_NWK_SIGNAL_NO_ACTIVE_LINKS_LEFT:
            /* This signal informs the application that all links to other routers has expired.
             * In such situation, the node can communicate only with its children.
             *
             * Example reasons of signal generation:
             *  - The device was brought too far from the rest of the network.
             *  - There was a power cut and the whole network suddenly disappeared.
             *
             * Note: This signal is not generated for the coordinator node, since it may operate alone
             *       in the network.
             */
            NRF_LOG_WARNING("Parent is unreachable");
            break;

        case ZB_BDB_SIGNAL_FINDING_AND_BINDING_TARGET_FINISHED:
            /* This signal informs the Finding & Binding target device that the procedure has finished
             * and the other device has been bound or the procedure timed out.
             */
            NRF_LOG_INFO("Find and bind target finished (status: %d)", status);
            break;

#ifndef ZB_ED_ROLE
        case ZB_NWK_SIGNAL_PANID_CONFLICT_DETECTED:
            /* This signal informs the Router and Coordinator that conflict PAN ID has been detected
             * and needs to be resolved. In order to do that *zb_start_pan_id_conflict_resolution* is called.
             */
            {
                NRF_LOG_INFO("PAN ID conflict detected, trying to resolve... ");

                zb_bufid_t buf_copy = zb_buf_get_out();
                if (buf_copy)
                {
                    zb_buf_copy(buf_copy, bufid);
                    ZVUNUSED(ZB_ZDO_SIGNAL_CUT_HEADER(buf_copy));

                    zb_start_pan_id_conflict_resolution(buf_copy);
                }
                else
                {
                    NRF_LOG_ERROR("No free buffer available, skipping conflict resolving this time.")
                }
            }
            break;
#endif

        case ZB_ZDO_SIGNAL_DEFAULT_START:
        case ZB_NWK_SIGNAL_DEVICE_ASSOCIATED:
            /* Obsolete signals, used for pre-R21 ZBOSS API. Ignore. */
            break;

        case ZB_NLME_STATUS_INDICATION:{
            
            /*
            NRF_LOG_INFO("ZB_NLME_STATUS_INDICATION\r\n");
            zb_zdo_signal_nlme_status_indication_params_t * p_nlme_status_indication_params;
            p_nlme_status_indication_params = ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_zdo_signal_nlme_status_indication_params_t);
            NRF_LOG_INFO("status: %d\n", p_nlme_status_indication_params->nlme_status.status);
            NRF_LOG_INFO("network_addr: %X\n", p_nlme_status_indication_params->nlme_status.network_addr);
            NRF_LOG_INFO("unknown_command_id: %X\n", p_nlme_status_indication_params->nlme_status.unknown_command_id);
            NRF_LOG_INFO("NLME status indicates");
            if(pairing_in_progress) zb_bdb_reset_via_local_action(0);
            */
              zb_zdo_signal_nlme_status_indication_params_t * nlme_status_ind =
              ZB_ZDO_SIGNAL_GET_PARAMS(p_sg_p, zb_zdo_signal_nlme_status_indication_params_t);
              if (nlme_status_ind->nlme_status.status == ZB_NWK_COMMAND_STATUS_PARENT_LINK_FAILURE) {

              /* Check for broken rejoin procedure and restart the device to recover. */
              if (m_stack_initialised && !joining_signal_received) {
              zb_reset(0);
              }
            }
            break;
        }
        default:
            /* Unimplemented signal. For more information see: zb_zdo_app_signal_type_e and zb_ret_e. */
            NRF_LOG_INFO("Unimplemented signal (signal: %d, status: %d)", sig, status);
            break;
    }

    /* If configured, process network rejoin procedure. */
    rejoin_the_network(0);

    if ((ret_code == RET_OK) && (comm_status != ZB_TRUE))
    {
        ret_code = RET_ERROR;
    }

    return ret_code;
}

void zigbee_led_status_update(zb_bufid_t bufid, uint32_t led_idx)
{
    zb_zdo_app_signal_hdr_t  * p_sg_p = NULL;
    zb_zdo_app_signal_type_t   sig    = zb_get_app_signal(bufid, &p_sg_p);
    zb_ret_t                   status = ZB_GET_APP_SIGNAL_STATUS(bufid);

    switch (sig)
    {
        case ZB_BDB_SIGNAL_DEVICE_REBOOT:
            /* fall-through */
        case ZB_BDB_SIGNAL_STEERING:
            if (status == RET_OK)
            {
                bsp_board_led_on(led_idx);
            }
            else
            {
                bsp_board_led_off(led_idx);
            }
            break;

        case ZB_ZDO_SIGNAL_LEAVE:
            /* Update network status LED */
            bsp_board_led_off(led_idx);
            break;

        default:
            break;
    }
}

/**@brief Start network steering.
 */
static void start_network_steering(zb_uint8_t param)
{
    zb_bool_t started = bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING);

    ZVUNUSED(param);

    NRF_LOG_INFO("Network steering restarted (started: %d)", started);
}

/**@brief Process rejoin procedure. To be called in signal handler.
 */
static void rejoin_the_network(zb_uint8_t param)
{
    ZVUNUSED(param);

    if (m_stack_initialised && m_is_rejoin_procedure_started)
    {
        if (m_is_rejoin_stop_requested)
        {
            m_is_rejoin_procedure_started = ZB_FALSE;
            m_is_rejoin_stop_requested = ZB_FALSE;

#if defined ZB_ED_ROLE
            NRF_LOG_INFO("Network rejoin procedure stopped as %sscheduled.", (m_wait_for_user_input) ? "" : "NOT ");
#elif defined ZB_ROUTER_ROLE
            NRF_LOG_INFO("Network rejoin procedure stopped.");
#endif
        }
        else if (!m_is_rejoin_in_progress)
        {
            /* Calculate new timeout */
            zb_time_t timeout_s;
            if ((1 << m_rejoin_attempt_cnt) > REJOIN_INTERVAL_MAX_S)
            {
                timeout_s = REJOIN_INTERVAL_MAX_S;
            }
            else
            {
                timeout_s = (1 << m_rejoin_attempt_cnt);
                m_rejoin_attempt_cnt++;
            }

