Uhome-systems/Uhome/Software/nRF5_SDK_for_Zigbee_v4.2.0/examples/zigbee/experimental/SmartValve/zigbee_helpers_TWV.c
            zb_ret_t zb_err_code = ZB_SCHEDULE_APP_ALARM(start_network_steering, ZB_FALSE, ZB_MILLISECONDS_TO_BEACON_INTERVAL(timeout_s * 1000));
            ZB_ERROR_CHECK(zb_err_code);

            m_is_rejoin_in_progress= ZB_TRUE;
        }
    }
}

/**@brief Function for starting rejoin network procedure.
 *
 * @note  For Router device if stack is initialised, device is not joined
 *        and rejoin procedure is not running, start rejoin procedure.
 *
 * @note  For End Device if stack is initialised, rejoin procedure is not running,
 *        device is not joined and device is not waiting for the user input, start rejoin procedure.
 *        Additionally, schedule alarm to stop rejoin procedure after the timeout defined by ZB_DEV_REJOIN_TIMEOUT_MS.
 */
static void start_network_rejoin(void)
{
#if defined ZB_ED_ROLE
    if (!ZB_JOINED() && m_stack_initialised && !m_wait_for_user_input)
#elif defined ZB_ROUTER_ROLE
    if (!ZB_JOINED() && m_stack_initialised)
#endif
    {
        m_is_rejoin_in_progress         = ZB_FALSE;

        if (!m_is_rejoin_procedure_started)
        {
            m_is_rejoin_procedure_started   = ZB_TRUE;
            m_is_rejoin_stop_requested      = ZB_FALSE;
            m_is_rejoin_in_progress         = ZB_FALSE;
            m_rejoin_attempt_cnt            = 0;

#if defined ZB_ED_ROLE
            m_wait_for_user_input           = ZB_FALSE;
            m_is_rejoin_start_scheduled     = ZB_FALSE;

            zb_ret_t zb_err_code = ZB_SCHEDULE_APP_ALARM(stop_network_rejoin, ZB_TRUE, ZB_MILLISECONDS_TO_BEACON_INTERVAL(ZB_DEV_REJOIN_TIMEOUT_MS));
            ZB_ERROR_CHECK(zb_err_code);
#endif

            NRF_LOG_INFO("Started network rejoin procedure.");
        }
    }
}

/**@brief Function for stopping rejoin network procedure and related scheduled alarms.
 *
 * @param[in] was_scheduled   Zigbee flag to indicate if the function was scheduled or called directly.
 */
static void stop_network_rejoin(zb_uint8_t was_scheduled)
{
    /* For Router and End Device:
     *   Try to stop scheduled network steering. Stop rejoin procedure or if no network steering was scheduled,
     *   request rejoin stop on next rejoin_the_network() call.
     * For End Device only:
     *   If stop_network_rejoin() was called from scheduler, the rejoin procedure has reached timeout,
     *   set m_wait_for_user_input to ZB_TRUE so the rejoin procedure can only be started by calling user_input_indicate().
     *   If not, set m_wait_for_user_input to ZB_FALSE.
     */

    zb_ret_t zb_err_code;

#if defined ZB_ED_ROLE
    /* Set m_wait_for_user_input depending on if the device should retry joining on user_input_indication() */
    m_wait_for_user_input = was_scheduled;
#elif defined ZB_ROUTER_ROLE
    ZVUNUSED(was_scheduled);
#endif

    if (m_is_rejoin_procedure_started)
    {
        zb_err_code = ZB_SCHEDULE_APP_ALARM_CANCEL(start_network_steering, ZB_ALARM_ANY_PARAM);
        if (zb_err_code == RET_OK)
        {
            /* Stop rejoin procedure */
            m_is_rejoin_procedure_started = ZB_FALSE;
            m_is_rejoin_stop_requested = ZB_FALSE;
#if defined ZB_ED_ROLE
            NRF_LOG_INFO("Network rejoin procedure stopped as %sscheduled.", (m_wait_for_user_input) ? "" : "not ");
#elif defined ZB_ROUTER_ROLE
            NRF_LOG_INFO("Network rejoin procedure stopped.");
#endif
        }
        else
        {
            /* Request rejoin procedure stop */
            m_is_rejoin_stop_requested = ZB_TRUE;
            NRF_LOG_INFO("Network rejoin procedure requested to be stopped.");
        }
    }

#if defined ZB_ED_ROLE
    /* Make sure scheduled stop alarm is canceled. */
    zb_err_code = ZB_SCHEDULE_APP_ALARM_CANCEL(stop_network_rejoin, ZB_ALARM_ANY_PARAM);
    if (zb_err_code != RET_NOT_FOUND)
    {
        ZB_ERROR_CHECK(zb_err_code);
    }
#endif
}

#if defined ZB_ED_ROLE
/* Function to be scheduled when user_input_indicate() is called and m_wait_for_user_input is ZB_TRUE */
static void start_network_rejoin_ED(zb_uint8_t param)
{
    ZVUNUSED(param);
    if (!ZB_JOINED() && m_wait_for_user_input)
    {
        zb_ret_t zb_err_code;

        m_wait_for_user_input = ZB_FALSE;
        start_network_rejoin();

        zb_err_code = ZB_SCHEDULE_APP_ALARM(rejoin_the_network, 0, ZB_TIME_ONE_SECOND);
        ZB_ERROR_CHECK(zb_err_code);
    }
    m_is_rejoin_start_scheduled = ZB_FALSE;
}

/* Function to be called by an application e.g. inside button handler function */
void user_input_indicate(void)
{
    if (m_wait_for_user_input && !(m_is_rejoin_start_scheduled))
    {
        zb_ret_t zb_err_code = RET_OK;

        zb_err_code = ZB_SCHEDULE_APP_CALLBACK(start_network_rejoin_ED, 0);
        ZB_ERROR_CHECK(zb_err_code);

        /* Prevent scheduling multiple rejoin starts */
        if (!zb_err_code)
        {
            m_is_rejoin_start_scheduled = ZB_TRUE;
        }
    }
}
#endif

/**@bried Calculate bottom addresss of RAM bank with given id.
 *
 * @param[in] bank_id  ID of RAM bank to get start address of.
 *
 * @return    Start address of RAM bank.
 */
static inline uint32_t ram_bank_bottom_addr(uint8_t bank_id)
{
    return RAM_START_ADDRESS + bank_id * RAM_BANK_0_7_SECTION_SIZE * RAM_BANK_0_7_SECTIONS_NBR;
}

/* Function for powering down unused RAM. */
void zigbee_power_down_unused_ram(void)
{
#if defined(NRF52811_XXAA) || defined(NRF52833_XXAA) || defined(NRF52840_XXAA)

    /* ID of top RAM bank */
#if defined(NRF52811_XXAA)
    uint8_t     bank_id                 = 3;
#elif defined(NRF52833_XXAA) || defined(NRF52840_XXAA)
    uint8_t     bank_id                 = 8;
#endif
    uint8_t     section_id              = 5;
    uint32_t    section_size            = 0;
    /* Mask to power down whole RAM bank */
    uint32_t    ram_bank_power_off_mask = 0xFFFFFFFF;

    /* Power off banks with unused RAM only */
    while (RAM_END_ADDRESS <= ram_bank_bottom_addr(bank_id))
    {
        NRF_LOG_DEBUG("Powering off bank: %d.", bank_id);
#ifdef SOFTDEVICE_PRESENT
        ret_code_t ret_val;

        ret_val = sd_power_ram_power_clr(bank_id, ram_bank_power_off_mask);
        APP_ERROR_CHECK(ret_val);
#else
        nrf_power_rampower_mask_off(bank_id, ram_bank_power_off_mask);
#endif /* defined SOFTDEVICE_PRESENT*/
        bank_id--;
    }

    /* Set id of top section and section size for given bank */
    section_id = (bank_id == 8) ? (RAM_BANK_8_SECTIONS_NBR - 1) : (RAM_BANK_0_7_SECTIONS_NBR - 1);
    section_size = (bank_id == 8) ? RAM_BANK_8_SECTION_SIZE : RAM_BANK_0_7_SECTION_SIZE;

    /* Power off remaining sections of unused RAM */
    while (RAM_END_ADDRESS <= (ram_bank_bottom_addr(bank_id) + section_id * section_size))
    {
        NRF_LOG_DEBUG("Powering off section %d of bank %d.", section_id, bank_id);
#ifdef SOFTDEVICE_PRESENT
        ret_code_t ret_val;

        ret_val = sd_power_ram_power_clr(bank_id, ((NRF_POWER_RAMPOWER_S0POWER << section_id) |
                                                   (NRF_POWER_RAMPOWER_S0RETENTION << section_id)));
        APP_ERROR_CHECK(ret_val);
#else
        nrf_power_rampower_mask_off(bank_id, ((NRF_POWER_RAMPOWER_S0POWER << section_id) |
                                              (NRF_POWER_RAMPOWER_S0RETENTION << section_id)));
#endif /* defined SOFTDEVICE_PRESENT*/

        section_id--;
    }

#else
#warning "Unsupported MCU - No RAM is powered down"
#endif /* defined NRF52811_XXAA || defined NRF52833_XXAA || defined NRF52840_XXAA */
}
